Autodesk.Revit.DB.Visual.AssetType
Enumerated asset types
RenderingAsset Types.

Autodesk.Revit.DB.Visual.AssetType.Content
Content assets (RPC / entourage).

Autodesk.Revit.DB.Visual.AssetType.Appearance
Appearance assets (materials).